Tutorial/20230515224220-emacs_evil_mode.org
:PROPERTIES:
:ID:       68a61d12-91dd-48af-ae62-11bfe9386c87
:END:
#+TITLE: Emacs Evil mode
#+SETUPFILE: /home/unseen/Documents/Notes/org/roam/org-setup.org

#+CREATED: [2023-05-15 Mon 22:42]
#+LAST_MODIFIED: [2023-05-16 Tue 00:13]

+ [[id:95b6342a-ca5b-4f59-9f08-6cbd3aedf7a2][Emacs]]

* Evil Mode
Emacs evil mode is a package for vimmers who see the power of emacs.


** Disable evil mode for certain modes
Some modes do not require the use of evil-mode and infact are just single key commands.

[[id:1561f948-9a4d-4936-a58f-90a6b87ddb06][Elfeed]] is such a package that doesnt mesh with evil.

Use the ~evil-set-inital-state~ function to set a state or use ~turn-off-evil-mode~

Disable evil for elfeed.
#+begin_src emacs-lisp
(add-hook 'elfeed-search-mode-hook 'turn-off-evil-mode)
(add-hook 'elfeed-show-mode-hook 'turn-off-evil-mode)
#+end_src
